In [3]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv("Student_Marks.csv")

In [5]:
data

    number_courses  time_study   Marks
0                3       4.508  19.202
1                4       0.096   7.734
2                4       3.133  13.811
3                6       7.909  53.018
4                8       7.811  55.299
..             ...         ...     ...
95               6       3.561  19.128
96               3       0.301   5.609
97               4       7.163  41.444
98               7       0.309  12.027
99               3       6.335  32.357

[100 rows x 3 columns]

In [6]:
x = data.drop(labels = ["Marks"],axis=1)

In [7]:
x

    number_courses  time_study
0                3       4.508
1                4       0.096
2                4       3.133
3                6       7.909
4                8       7.811
..             ...         ...
95               6       3.561
96               3       0.301
97               4       7.163
98               7       0.309
99               3       6.335

[100 rows x 2 columns]

In [10]:
y = data[["Marks"]]

In [11]:
y

     Marks
0   19.202
1    7.734
2   13.811
3   53.018
4   55.299
..     ...
95  19.128
96   5.609
97  41.444
98  12.027
99  32.357

[100 rows x 1 columns]

In [13]:
numerical_columns = x.select_dtypes(exclude="object").columns

In [14]:
numerical_columns

Index(['number_courses', 'time_study'], dtype='object')